/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   time_t.h                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aberry <aberry@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/05 18:05:01 by aberry            #+#    #+#             */
/*   Updated: 2021/04/09 18:22:58 by aberry           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef TIME_T_H
# define TIME_T_H

# include <unistd.h>
# include <sys/time.h>

/*
********************************************************************************
*/

/*
** Останавливает тред на заданное количество милисекунд
*/
int				ft_msleep(useconds_t time);

/*
** Текущее время в милисекундах
*/
unsigned long	ft_gettimeofday(void);

/*
** Прошедшее время со старта программы
*/
unsigned long	ft_get_time_now(unsigned long t_time);
/*
********************************************************************************
*/

#endif