/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   utils.h                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aberry <aberry@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/05 18:05:01 by aberry            #+#    #+#             */
/*   Updated: 2021/04/05 20:37:02 by aberry           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef TOOLS_H
# define TOOLS_H

#include <stdio.h>

/*
*************************************TOOLS**************************************
*/

/*
** Возвращает строку переведенную в число
*/
long				ft_get_number(const char *str);

/*
** Является ли символ числом
*/
int					ft_isdigit(int c);

/*
** Входит ли число в диапозон int
*/
int					ft_ismoreint(long number, const char *line);

/*
** Является ли символ пробельным
*/
int					ft_isspace(int c);

/*
** Возвращает длину строку
*/
size_t				ft_strlen(const char *str);

/*
** Является ли строка числом
*/
int					ft_isnumber(const char *line);

/*
********************************************************************************
*/

#endif